import React from "react";

const BlogContent = () => {
  return (
    <div className="text-basic">
      <p>
        বিশ্বসেরা পরিবেশবান্ধব কারখানার স্বীকৃতি পেয়েছে বাংলাদেশের গ্রিন
        টেক্সটাইল লিমিটেড ইউনিট-৪। লিড সনদে সর্বোচ্চ নম্বর পেয়ে সবুজ কারখানার
        শীর্ষস্থান দখল করে নিয়েছে কারখানাটি। ১১০ নম্বরের মধ্যে প্রতিষ্ঠানটি
        পেয়েছে ১০৪। আর তাই বিশ্বের সবচেয়ে পরিবেশবান্ধব ১০টি কারখানার ৮টিই
        বাংলাদেশের। আর বিশ্বসেরা ১০০ কারখানার মধ্যে বাংলাদেশের ৫২টি। শনিবার লিড
        সনদের এই তালিকা প্রকাশিত হলে বিজিএমইএ এ খবর নিশ্চিত করে। <br /> <br />{" "}
        শীর্ষ ১০-এর মধ্যে থাকা দেশের পরিবেশবান্ধব কারখানাগুলো হলো রেমি হোল্ডিংস
        লিমিটেড, ফতুল্লা অ্যাপারেলস, তারাসিমা অ্যাপারেলস লিমিটেড, প্লামি ফ্যাশনস
        লিমিটেড, সিল্কেন সুইং লিমিটেড, মিথেলা টেক্সটাইল ইন্ডাস্ট্রিজ লিমিটেড।
        তবে তালিকার তৃতীয় স্থানে থাকা বাংলাদেশি কারখানার নাম প্রকাশ করা হয়নি।
        শুধু দেশের নাম উল্লেখ করা হয়েছে।
        <br /> <br /> এই ১০ কোম্পানির সব কটিই প্লাটিনাম সনদ পেয়েছে। ১১০-এর মধ্যে
        যেসব কোম্পানি ৮০ বা তার চেয়ে বেশি নম্বর পায়, তারা প্লাটিনাম সনদ লাভ করে।
        কোনো কারখানা ৬০ থেকে ৭৯ নম্বর পেলে গোল্ড সনদ পায়, ৫০ থেকে ৫৯ পেলে পায়
        সিলভার সনদ আর ৪০ থেকে ৪৯ পেলে পায় সার্টিফায়েড সনদ।
        <br /> <br /> বিশ্বের বেশ কিছু প্রতিষ্ঠান পরিবেশবান্ধব স্থাপনার সনদ দিয়ে
        থাকে। তাদের মধ্যে অন্যতম একটি যুক্তরাষ্ট্রের ইউএস গ্রিন বিল্ডিং কাউন্সিল
        (ইউএসজিবিসি)। তারা ‘লিড’ নামে পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। এই
        লিডের তালিকায় গ্রিন টেক্সটাইল এখন শীর্ষ পরিবেশবান্ধব কারখানা। এপিক গ্রুপ
        ও এনভয় লিগ্যাসির যৌথ উদ্যোগে ২০১০ সালে প্রতিষ্ঠিত হয় তৈরি পোশাকশিল্পের
        কোম্পানি গ্রিন টেক্সটাইল।
        <br /> <br />
        লিডের পূর্ণাঙ্গ রূপ লিডারশিপ ইন এনার্জি অ্যান্ড এনভায়রনমেন্টাল ডিজাইন।
        সনদটি পেতে একটি প্রকল্পকে ইউএসজিবিসির তত্ত্বাবধানে নির্মাণ থেকে উৎপাদন
        পর্যন্ত বিভিন্ন বিষয়ে সর্বোচ্চ মান রক্ষা করতে হয়। এ জন্য নতুন ভবন
        নির্মাণ কিংবা পুরনো ভবন সংস্কার করেও আবেদন করা যায়।
        <br /> <br />
        লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ এ
        তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশি বেশি
        কোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে ৯টি
        কারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ও তাইওয়ানের
        আছে ৪টি করে কারখানা।
        <br /> <br /> পোশাকশিল্পের উদ্যোক্তা সাজ্জাদুর রহমান মৃধার হাত ধরে ২০১২
        সালে দেশে পরিবেশবান্ধব কারখানার যাত্রা শুরু হয়। পাবনার ঈশ্বরদী ইপিজেডে
        তার প্রতিষ্ঠিত ভিনটেজ ডেনিম স্টুডিও প্রথম এই মর্যাদা লাভ করে।
        <br /> <br /> বর্তমানে বিশ্বে অন্য যেকোনো দেশের চেয়ে বাংলাদেশেই সবচেয়ে
        বেশি পরিবেশবান্ধব পোশাক ও বস্ত্রকল রয়েছে। তৈরি পোশাক ও বস্ত্র খাতের
        পাশাপাশি শিপইয়ার্ড, জুতা ও ইলেকট্রনিকস পণ্য খাতেও আছে পরিবেশবান্ধব
        কারখানা। বাণিজ্যিক ভবনও হচ্ছে পরিবেশবান্ধব, তবে সংখ্যায় কম। বিজিএমএইএর
        তথ্যানুসারে, বাংলাদেশে পরিবেশবান্ধব কারখানার সংখ্যা ১৮৩। আরও পাঁচ শতাধিক
        কারখানা এই সনদ পাওয়ার প্রক্রিয়ায় আছে বলে জানিয়েছে তারা।
      </p>
    </div>
  );
};

export default BlogContent;
