import React from "react";
import { Link, useParams } from "react-router-dom";
import BlogContent from "../../Components/Isolated/BlogsComponents/BlogContent";
import BlogsAdd from "../../Components/Isolated/BlogsComponents/BlogsAdd";
import BlogsHeading from "../../Components/Isolated/BlogsComponents/BlogsHeading";
import BlogsSubHeading from "../../Components/Isolated/BlogsComponents/BlogsSubHeading";
import CommentBox from "../../Components/Isolated/BlogsComponents/CommentBox";
import MoreBlogsVertical from "../../Components/Isolated/BlogsComponents/MoreBlogsVertical";
import SocialMedia from "../../Components/Isolated/SocialMedia";

const data = [
  {
    id: 1,
    heading: "প্রথম সন্দেশ, সবচেয়ে সেরা 1",
    headline:
      "বিশ্বের এক নম্বর কারখানা এখন বাংলাদেশে 1বিশ্বের এক নম্বর কারখানা এখন বাংলাদেশে 1বিশ্বের এক নম্বর কারখানা এখন বাংলাদেশে 1",
    editor: "গোলাম রাব্বী",
    date: "২ এপ্রিল ২০২৩",
    subHeading:
      " লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশিবেশি কোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে৯টি কারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ওতাইওয়ানের আছে ৪টি করে কারখানা।",
    blogContent:
      "শীর্ষ ১০-এর মধ্যে থাকা দেশের পরিবেশবান্ধ কারখানাগুলো হলো রেমি হোল্ডিংস লিমিটেড, ফতুল্লা অ্যাপারেলস, তারাসিম অ্যাপারেলস লিমিটেড, প্লামি ফ্যাশনস লিমিটেড, সিল্কেন সুইং লিমিটেড, মিথেল টেক্সটাইল ইন্ডাস্ট্রিজ লিমিটেড। তবে তালিকার তৃতীয় স্থানে থাকা বাংলাদেশ কারখানার নাম প্রকাশ করা হয়নি। শুধু দেশের নাম উল্লেখ করা হয়েছে । এই ১০ কোম্পানির সব কটিই প্লাটিনাম সনদ পেয়েছে। ১১০-এর মধ্য যেসব কোম্পানি ৮০ বা তার চেয়ে বেশি নম্বর পায়, তারা প্লাটিনাম সনদ লাভ করে কোনো কারখানা ৬০ থেকে ৭৯ নম্বর পেলে গোল্ড সনদ পায়, ৫০ থেকে ৫৯ পেলে পায় সিলভার সনদ আর ৪০ থেকে ৪৯ পেলে পায় সার্টিফায়েড সনদ। বিশ্বের বেশ কিছু প্রতিষ্ঠান পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। তাদের মধ্যে অন্যতম একটি যুক্তরাষ্ট্রের ইউএস গ্রিন বিল্ডিং কাউন্সিল (ইউএসজিবিসি)। তারা ‘লিড’ নামে পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। এই লিডের তালিকায় গ্রিন টেক্সটাইল এখন শীর্ষ পরিবেশবান্ধব কারখানা। এপিক গ্রুপ ও এনভয় লিগ্যাসির যৌথ উদ্যোগে ২০১০ সালে প্রতিষ্ঠিত হয় তৈরি পোশাকশিল্পের কোম্পানি গ্রিন টেক্সটাইল।  লিডের পূর্ণাঙ্গ রূপ লিডারশিপ ইন এনার্জি অ্যান্ড এনভায়রনমেন্টাল ডিজাইন। সনদটি পেতে একটি প্রকল্পকে ইউএসজিবিসির তত্ত্বাবধানে নির্মাণ থেকে উৎপাদন পর্যন্ত বিভিন্ন বিষয়ে সর্বোচ্চ মান রক্ষা করতে হয়। এ জন্য নতুন ভবন নির্মাণ কিংবা পুরনো ভবন সংস্কার করেও আবেদন করা যায়। লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশি বেশকোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে ৯টকারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ও তাইওয়ানেআছে ৪টি করে কারখানা। । পোশাকশিল্পের উদ্যোক্তা সাজ্জাদুর রহমান মৃধার হাত ধরে ২০১সালে দেশে পরিবেশবান্ধব কারখানার যাত্রা শুরু হয়। পাবনার ঈশ্বরদী ইপিজেডতার প্রতিষ্ঠিত ভিনটেজ ডেনিম স্টুডিও প্রথম এই মর্যাদা লাভ করে। । বর্তমানে বিশ্বে অন্য যেকোনো দেশের চেয়ে বাংলাদেশেই সবচেয়বেশি পরিবেশবান্ধব পোশাক ও বস্ত্রকল রয়েছে। তৈরি পোশাক ও বস্ত্র খাতেপাশাপাশি শিপইয়ার্ড, জুতা ও ইলেকট্রনিকস পণ্য খাতেও আছে পরিবেশবান্ধকারখানা। বাণিজ্যিক ভবনও হচ্ছে পরিবেশবান্ধব, তবে সংখ্যায় কম। বিজিএমএইএতথ্যানুসারে, বাংলাদেশে পরিবেশবান্ধব কারখানার সংখ্যা ১৮৩। আরও পাঁচ শতাধিকারখানা এই সনদ পাওয়ার প্রক্রিয়ায় আছে বলে জানিয়েছে তারা।",
  },
  {
    id: 2,
    heading: "প্রথম সন্দেশ, সবচেয়ে সেরা 2",
    headline: "বিশ্বের এক নম্বর কারখানা এখন বাংলাদেশে 2",
    editor: "গোলাম রাব্বী",
    date: "২৬ এপ্রিল ২০২৩",
    subHeading:
      " লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশিবেশি কোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে৯টি কারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ওতাইওয়ানের আছে ৪টি করে কারখানা।",
    blogContent:
      "শীর্ষ ১০-এর মধ্যে থাকা দেশের পরিবেশবান্ধ কারখানাগুলো হলো রেমি হোল্ডিংস লিমিটেড, ফতুল্লা অ্যাপারেলস, তারাসিম অ্যাপারেলস লিমিটেড, প্লামি ফ্যাশনস লিমিটেড, সিল্কেন সুইং লিমিটেড, মিথেল টেক্সটাইল ইন্ডাস্ট্রিজ লিমিটেড। তবে তালিকার তৃতীয় স্থানে থাকা বাংলাদেশ কারখানার নাম প্রকাশ করা হয়নি। শুধু দেশের নাম উল্লেখ করা হয়েছে । । এই ১০ কোম্পানির সব কটিই প্লাটিনাম সনদ পেয়েছে। ১১০-এর মধ্য যেসব কোম্পানি ৮০ বা তার চেয়ে বেশি নম্বর পায়, তারা প্লাটিনাম সনদ লাভ করে কোনো কারখানা ৬০ থেকে ৭৯ নম্বর পেলে গোল্ড সনদ পায়, ৫০ থেকে ৫৯ পেলে পায় সিলভার সনদ আর ৪০ থেকে ৪৯ পেলে পায় সার্টিফায়েড সনদ। । । বিশ্বের বেশ কিছু প্রতিষ্ঠান পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। তাদের মধ্যে অন্যতম একটি যুক্তরাষ্ট্রের ইউএস গ্রিন বিল্ডিং কাউন্সিল (ইউএসজিবিসি)। তারা ‘লিড’ নামে পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। এই লিডের তালিকায় গ্রিন টেক্সটাইল এখন শীর্ষ পরিবেশবান্ধব কারখানা। এপিক গ্রুপ ও এনভয় লিগ্যাসির যৌথ উদ্যোগে ২০১০ সালে প্রতিষ্ঠিত হয় তৈরি পোশাকশিল্পের কোম্পানি গ্রিন টেক্সটাইল। । । লিডের পূর্ণাঙ্গ রূপ লিডারশিপ ইন এনার্জি অ্যান্ড এনভায়রনমেন্টাল ডিজাইন। সনদটি পেতে একটি প্রকল্পকে ইউএসজিবিসির তত্ত্বাবধানে নির্মাণ থেকে উৎপাদন পর্যন্ত বিভিন্ন বিষয়ে সর্বোচ্চ মান রক্ষা করতে হয়। এ জন্য নতুন ভবন নির্মাণ কিংবা পুরনো ভবন সংস্কার করেও আবেদন করা যায়। । লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশি বেশকোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে ৯টকারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ও তাইওয়ানেআছে ৪টি করে কারখানা। । পোশাকশিল্পের উদ্যোক্তা সাজ্জাদুর রহমান মৃধার হাত ধরে ২০১সালে দেশে পরিবেশবান্ধব কারখানার যাত্রা শুরু হয়। পাবনার ঈশ্বরদী ইপিজেডতার প্রতিষ্ঠিত ভিনটেজ ডেনিম স্টুডিও প্রথম এই মর্যাদা লাভ করে। । বর্তমানে বিশ্বে অন্য যেকোনো দেশের চেয়ে বাংলাদেশেই সবচেয়বেশি পরিবেশবান্ধব পোশাক ও বস্ত্রকল রয়েছে। তৈরি পোশাক ও বস্ত্র খাতেপাশাপাশি শিপইয়ার্ড, জুতা ও ইলেকট্রনিকস পণ্য খাতেও আছে পরিবেশবান্ধকারখানা। বাণিজ্যিক ভবনও হচ্ছে পরিবেশবান্ধব, তবে সংখ্যায় কম। বিজিএমএইএতথ্যানুসারে, বাংলাদেশে পরিবেশবান্ধব কারখানার সংখ্যা ১৮৩। আরও পাঁচ শতাধিকারখানা এই সনদ পাওয়ার প্রক্রিয়ায় আছে বলে জানিয়েছে তারা।",
  },
  {
    id: 3,
    heading: "প্রথম সন্দেশ, সবচেয়ে সেরা 3",
    headline: "বিশ্বের এক নম্বর কারখানা এখন বাংলাদেশে 3",
    editor: "গোলাম রাব্বী",
    date: "12 এপ্রিল ২০২৩",
    subHeading:
      " লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশিবেশি কোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে৯টি কারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ওতাইওয়ানের আছে ৪টি করে কারখানা।",
    blogContent:
      "শীর্ষ ১০-এর মধ্যে থাকা দেশের পরিবেশবান্ধ কারখানাগুলো হলো রেমি হোল্ডিংস লিমিটেড, ফতুল্লা অ্যাপারেলস, তারাসিম অ্যাপারেলস লিমিটেড, প্লামি ফ্যাশনস লিমিটেড, সিল্কেন সুইং লিমিটেড, মিথেল টেক্সটাইল ইন্ডাস্ট্রিজ লিমিটেড। তবে তালিকার তৃতীয় স্থানে থাকা বাংলাদেশ কারখানার নাম প্রকাশ করা হয়নি। শুধু দেশের নাম উল্লেখ করা হয়েছে । এই ১০ কোম্পানির সব কটিই প্লাটিনাম সনদ পেয়েছে। ১১০-এর মধ্য যেসব কোম্পানি ৮০ বা তার চেয়ে বেশি নম্বর পায়, তারা প্লাটিনাম সনদ লাভ করে কোনো কারখানা ৬০ থেকে ৭৯ নম্বর পেলে গোল্ড সনদ পায়, ৫০ থেকে ৫৯ পেলে পায় সিলভার সনদ আর ৪০ থেকে ৪৯ পেলে পায় সার্টিফায়েড সনদ। বিশ্বের বেশ কিছু প্রতিষ্ঠান পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। তাদের মধ্যে অন্যতম একটি যুক্তরাষ্ট্রের ইউএস গ্রিন বিল্ডিং কাউন্সিল (ইউএসজিবিসি)। তারা ‘লিড’ নামে পরিবেশবান্ধব স্থাপনার সনদ দিয়ে থাকে। এই লিডের তালিকায় গ্রিন টেক্সটাইল এখন শীর্ষ পরিবেশবান্ধব কারখানা। এপিক গ্রুপ ও এনভয় লিগ্যাসির যৌথ উদ্যোগে ২০১০ সালে প্রতিষ্ঠিত হয় তৈরি পোশাকশিল্পের কোম্পানি গ্রিন টেক্সটাইল। লিডের পূর্ণাঙ্গ রূপ লিডারশিপ ইন এনার্জি অ্যান্ড এনভায়রনমেন্টাল ডিজাইন। সনদটি পেতে একটি প্রকল্পকে ইউএসজিবিসির তত্ত্বাবধানে নির্মাণ থেকে উৎপাদন পর্যন্ত বিভিন্ন বিষয়ে সর্বোচ্চ মান রক্ষা করতে হয়। এ জন্য নতুন ভবন নির্মাণ কিংবা পুরনো ভবন সংস্কার করেও আবেদন করা যায়। লিড তালিকার শীর্ষ ১০০টি কোম্পানির মধ্যে ৫২টি বাংলাদেশের, অর্থাৎ তালিকায় থাকা সবচেয়ে বেশি কোম্পানি এখন বাংলাদেশের। এরপর সবচেয়ে বেশি বেশকোম্পানি আছে চীনের। তাদের আছে ১০টি কারখানা। এরপর পাকিস্তানের আছে ৯টকারখানা। শ্রীলঙ্কা ও ভারতের আছে ৬টি করে কারখানা। ভিয়েতনাম ও তাইওয়ানেআছে ৪টি করে কারখানা। পোশাকশিল্পের উদ্যোক্তা সাজ্জাদুর রহমান মৃধার হাত ধরে ২০১সালে দেশে পরিবেশবান্ধব কারখানার যাত্রা শুরু হয়। পাবনার ঈশ্বরদী ইপিজেডতার প্রতিষ্ঠিত ভিনটেজ ডেনিম স্টুডিও প্রথম এই মর্যাদা লাভ করে। বর্তমানে বিশ্বে অন্য যেকোনো দেশের চেয়ে বাংলাদেশেই সবচেয়বেশি পরিবেশবান্ধব পোশাক ও বস্ত্রকল রয়েছে। তৈরি পোশাক ও বস্ত্র খাতেপাশাপাশি শিপইয়ার্ড, জুতা ও ইলেকট্রনিকস পণ্য খাতেও আছে পরিবেশবান্ধকারখানা। বাণিজ্যিক ভবনও হচ্ছে পরিবেশবান্ধব, তবে সংখ্যায় কম। বিজিএমএইএতথ্যানুসারে, বাংলাদেশে পরিবেশবান্ধব কারখানার সংখ্যা ১৮৩। আরও পাঁচ শতাধিকারখানা এই সনদ পাওয়ার প্রক্রিয়ায় আছে বলে জানিয়েছে তারা।",
  },
];

function BlogDetail() {
  const { id } = useParams();

  const found = data.find((obj) => {
    return obj.id === parseInt(id);
  });
  const filteredData = data.filter((obj) => {
    return obj.id !== parseInt(id);
  });
  console.log(filteredData);
  return (
    <div className="lg:py-24 lg:mx-20 mx-5">
      <BlogsHeading
        heading={found?.heading}
        headline={found?.headline}
        editor={found?.editor}
        date={found?.date}
      />
      <div className="grid grid-cols-1 lg:grid-cols-2">
        <div className="pb-14 lg:my-0">
          <BlogsSubHeading subHeading={found?.subHeading} />

          <BlogContent blogContent={found.blogContent} />
        </div>
        <div>
          <div className="mb-5 flex flex-col items-end lg:mx-36 mx-5">
            <BlogsAdd />
            <div className="my-5">
              <h3 className="2xs:text-[12px] text-basic text-xl font-bold text-left my-5">
                আরও পড়ুন
              </h3>
              {filteredData?.map((data) => (
                <Link to={`/blogs/${data?.id}`}>
                  <MoreBlogsVertical data={data} />
                </Link>
              ))}
            </div>

            {/* <Link to={`/blogs/`}>
              {" "}
              <MoreBlogsVertical />
            </Link> */}
          </div>
        </div>
      </div>
      <CommentBox />
      <SocialMedia />
    </div>
  );
}

export default BlogDetail;
